{
  "basic_info": {
    "name": "Argus",
    "role": "Unknown",
    "slug": "argus",
    "image_url": "https://liquipedia.net/commons/images/thumb/6/60/ML_icon_Argus_2021.png/20px-ML_icon_Argus_2021.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/6/60/ML_icon_Argus_2021.png/20px-ML_icon_Argus_2021.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Ability Type",
      "description": "Warmonger Ability TypeBuff DamagePhysical When Argus' Meteoric Sword reaches 100 Malice Energy, he will launch a Demonic Slash with his next Basic Attack, dealing 200 (+100%Total Physical Attack) Physical Damage and recovering 200 (+10%Total Physical Attack) HP. This attack ignores 40% of the target's Physical Defense.Argus' Metoric Sword gains 5 Malice Energy per second, and each of his Basic Attacks grants 10 Malice Energy (critical strikes grant an additional 5 energy)."
    },
    {
      "ability_type": "Skill1",
      "name": "Ability Type",
      "description": "Demonic Grip Ability TypeMobility AOE DamagePhysical Base Cooldown: 12.0 Argus stretches out a demonic hand in the target direction, dealing 125 (+60%Extra Physical Attack) Physical Damage to the first enemy hero or Creep hit, stunning them for 0.7s, and pulling him and the target towards each other. If no enemy is hit, Argus pulls himself toward the hand's destination instead.Use Again: Argus dashes and strikes in the target direction, dealing 175 (+100%Extra Physical Attack) Physical Damage to enemies along the path."
    },
    {
      "ability_type": "Skill2",
      "name": "Ability Type",
      "description": "Meteoric Sword Ability TypeDamage Debuff DamagePhysical Base Cooldown: 10.0 After a short delay, Argus thrusts his Meteoric Sword in the target direction, dealing 300 (+100%Total Physical Attack) Physical Damage to enemies hit (200% damage against minions) and reducing their Movement Speed by 80% for 0.8s. The delay time will decrease as Argus' Attack Speed increases.Enemy heroes or Creeps hit will be Cursed for 4s, during which they will leave a Cursed Trail behind. Argus gains 40% Movement Speed while on a Cursed Trail. Argus' Basic Attacks on Cursed targets will grant double Malice Energy.Meteoric Sword damage counts as Basic Attack damage and can trigger Attack Effects."
    },
    {
      "ability_type": "Ultimate",
      "name": "Ability Type",
      "description": "Eternal Evil Ability TypeDeath Immunity Buff Base Cooldown: 36.0 Argus removes all debuffs on himself (except for Suppression) and enters Eternal Evil state, gaining Death Immunity for 4s. While in this state, 100% of his damage dealt to enemy heroes will be converted into HP for him once the state ends.Leaving the Eternal Evil state also resets enemy Turrets' damage increase against Argus.Passive: Permanently increases the recharge of Malice Energy by 4 per second. Battlefield is my playground and I think nothing of life and death."
    }
  ],
  "lore": {
    "relationships": []
  },
  "patches": [],
  "esports_stats": []
}