{
  "basic_info": {
    "name": "Aulus",
    "role": "Unknown",
    "slug": "aulus",
    "image_url": "https://liquipedia.net/commons/images/thumb/b/b7/ML_icon_Aulus.png/20px-ML_icon_Aulus.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/b/b7/ML_icon_Aulus.png/20px-ML_icon_Aulus.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Ability Type",
      "description": "Fighting Spirit Ability TypeBuff Aulus adds a stack of Fighting Spirit to his axe per second for 3s after dealing damage to any enemy (up to 4 stacks). Each stack grants 3-12 extra Physical Attack and 1-4 Physical Penetration (scales with Undying Fury level).Aulus also gains 10% extra Movement Speed and 27-125 Basic Attack Damage at max Fighting Spirit stacks (scales with level). A war axe that fights more fiercely as the battle continues."
    },
    {
      "ability_type": "Skill1",
      "name": "Ability Type",
      "description": "Aulus, Charge! Ability TypeSpeed Up Slow Base Cooldown: 16.0 Base Mana Cost: 50 Aulus removes all slow effects and gains 30% extra Movement Speed and 20% Damage Reduction against attacks from the front for 5s. Aulus gains 1% Damage Reduction for every 10 extra Physical Attack, up to 60%."
    },
    {
      "ability_type": "Skill2",
      "name": "Ability Type",
      "description": "The Power of Axe Ability TypeBurst Buff DamagePhysical Base Cooldown: 5.0 Base Mana Cost: 40 Aulus brandishes his axe, dealing 150 (+120%Extra Physical Attack) Physical Damage to enemies in a fan-shaped area, and enhancing up to 6 of his next Basic Attacks for 3s according to the enemies hit (3 per Hero of Creep, 1 per Minion). Enhanced Basic Attacks gain 100% extra Attack Speed and restore 50 HP to Aulus."
    },
    {
      "ability_type": "Ultimate",
      "name": "Ability Type",
      "description": "Undying Fury Ability TypeSlow Buff DamagePhysical Base Cooldown: 50.0 Base Mana Cost: 150 Passive: Every time Undying Fury is upgraded, Aulus crafts a part for his axe in order. Blade Craft: Permanently increases his Basic Attacks' Physical Damage by 35. Hammer Craft: Permanently increases his Crit Chance by 10%. Handle Craft: Permanently increases his Attack Range by 65% and the range of The Power of Axe.Active: Aulus raises his axe and smashes it to the ground, dealing 210 (+100%Extra Physical Attack) Physical Damage to enemies in a line and slowing them by 90% for 0.5s. A burning trail that lasts for 5s is left on the ground, dealing 90 (+40%Extra Physical Attack) Physical Damage to enemies who walk on it every 0.5s and slowing them by 70%"
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}