{
  "basic_info": {
    "name": "Badang",
    "role": "Unknown",
    "slug": "badang",
    "image_url": "https://liquipedia.net/commons/images/thumb/3/36/ML_icon_Badang.png/20px-ML_icon_Badang.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/3/36/ML_icon_Badang.png/20px-ML_icon_Badang.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Chivalry Fist",
      "description": "Chivalry FistAbilityCC Damage After every 4 Basic Attacks, Badang's next Basic Attack deals 50(+30%Total Physical Attack) extra Physical Damage to enemies hit and knocks them back. Enemies that are knocked into obstacles will be stunned for 0.8s (minions and creeps are stunned directly). Fist Wind generated by Badang's skills can also trigger this effect."
    },
    {
      "ability_type": "Skill1",
      "name": "Fist Wind",
      "description": "Fist WindAbilityAoE SlowTypePhysical Basic ATK Badang unleashes a gust of Fist Wind in the target direction, dealing 160(+90%Total Physical Attack) Physical Damage to enemies hit, slowing them by 30% for 1.5s, and knocking them back. The Fist Wind will explode upon hitting an obstacle, dealing 120(+60%Total Physical Attack) Physical Damage to nearby enemies. Fist Wind can trigger attack effects and grants Badang 1 Chivalry Fist stack upon cast. Badang stores up to 2 Fist Wind charges and restores 1 charge every 11.0s. 2.0"
    },
    {
      "ability_type": "Skill2",
      "name": "Fist Break",
      "description": "Fist BreakAbilityBlink CCTypePhysical Skill/Blink Badang dashes in the target direction, dealing 230(+50%Total Physical Attack) Physical Damage to enemies in his path while gaining a 350(+150%Total Physical Attack) shield that lasts 5s. He stops immediately upon hitting an enemy hero, slightly knocking them back while creating an obstacle that lasts 4s behind them. Enemies hit by the obstacle are dealt 130(+30%Total Physical Attack) Physical Damage. Use Again: Badang removes the obstacle he created. 9.0"
    },
    {
      "ability_type": "Ultimate",
      "name": "Fist Crack",
      "description": "Fist CrackAbilityBurst AoETypePhysical Basic ATK Badang throws a flurry of punches in the target direction, dealing 80(+54%Total Physical Attack) Physical Damage to enemies hit multiple times (can trigger attack effects). The Fist Wind generated by the punches will explode upon hitting an obstacle, dealing 40(+27%Total Physical Attack) Physical Damage to nearby enemies. Badang is immune to control effects for the duration. 30.0Fight to protect and persist for benevolence"
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}