{
  "basic_info": {
    "name": "Cici",
    "role": "Unknown",
    "slug": "cici",
    "image_url": "https://liquipedia.net/commons/images/thumb/6/6b/ML_icon_Cici.png/20px-ML_icon_Cici.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/6/6b/ML_icon_Cici.png/20px-ML_icon_Cici.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Performer's Delight",
      "description": "Performer's DelightAbilityBUFF Cici generates a stack of Delight after dealing damage, increasing her Movement Speed by 0.75% and Spell Vamp by 0.75% per stack up to 10 times, doubling the effects at full stacks."
    },
    {
      "ability_type": "Skill1",
      "name": "Yo-Yo Blitz",
      "description": "Yo-Yo BlitzAbilityBurstTypePhysical Damage Cici uses Yoyo to continuously attack the nearest enemy within range (prioritizing heroes) for 3.5 seconds, hitting them up to 10 times and dealing Physical Damage equal to 60–85 plus 3–4.5 (+1.2% Extra Physical Attack)% of the target's Max HP per hit. Cici can move and use other skills during this attack. If there's no enemy hero within the range, Yoyo will attack Turrets or the Base instead. The skill deals 20% extra damage to Minions. Cooldown starts upon casting. Only suppression can cancel this skill, thus ending its duration; appropriate crowd control effects can only interrupt this skill. 6.5"
    },
    {
      "ability_type": "Skill2",
      "name": "Buoyant Bounce",
      "description": "Buoyant BounceAbilityBlinkTypePhysical Damage Cici leaps to a target location. If she lands on any unit (not including Turrets and Base), she can leap again in the Joystick's direction. If she lands on an enemy with the first leap, she deals 200–300 (+40% Total Physical Attack) Physical Damage to them. 9.5"
    },
    {
      "ability_type": "Ultimate",
      "name": "Curtain Call",
      "description": "Curtain CallAbilityCC SlowTypePhysical Damage Cici throws Yoyo at the target enemy hero and links them with another nearby enemy hero, dealing 100 (+10% Total Physical Attack) Physical Damage, slowing them by 30%, and pulling them together. During this time, Cici can use Yo-Yo Blitz to attack both linked targets at the same time. If only one is within the range of Yo-Yo Blitz, Cici will attack the target twice, but the damage of the second attack will be reduced to 20% Yoyo applied to an enemy counts as debuff, therefore, it can be removed by effects such as Purify. 40"
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}