{
  "basic_info": {
    "name": "Fredrinn",
    "role": "Unknown",
    "slug": "fredrinn",
    "image_url": "https://liquipedia.net/commons/images/thumb/b/bc/ML_icon_Fredrinn.png/20px-ML_icon_Fredrinn.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/b/bc/ML_icon_Fredrinn.png/20px-ML_icon_Fredrinn.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Crystalline Armor",
      "description": "Crystalline ArmorAbilityBUFF HEAL Fredrinn stores 85% of the damage he receives as Crystal Energy. The Crystal Energy decays after 8s at a rate of 5% Max HP per second. Fredrinn can convert the stored Crystal Energy into HP by 30% of his damage dealt (15% for damage dealt to minions). Fredrinn gains 1 Combo Point that lasts 6s each time his skill hits a non-minion enemy (up to 4 Combo Points). His Ultimate costs different numbers of Combo Points at different skill levels"
    },
    {
      "ability_type": "Skill1",
      "name": "Piercing Strike",
      "description": "Piercing StrikeAbilityDamage Fredrinn thrusts his sword in the target direction dealing 150 (+8% Total HP) Physical Damage to enemies hit and slowing them by 30% for 2s. His next Basic Attack gains extra attack range and deals 100(+120%Total Physical Attack) Physical Damage. This skill deals 150% damage to non-hero enemies. 8.5"
    },
    {
      "ability_type": "Skill2",
      "name": "Brave Assault",
      "description": "Brave AssaultAbilityBlink CC Fredrinn dashes in the target direction, dealing 200(+80%Extra Physical Attack) Physical Damage to the first non-minion enemy hit. His next Basic Attack knocks the target airborne for 0.3s. 8.5"
    },
    {
      "ability_type": "Ultimate",
      "name": "Appraiser's Wrath",
      "description": "Appraiser's WrathAbilityBurst AoE Fredrinn slams his sword in the target direction, dealing 600 plus 40% of his Crystal Energy as Physical Damage to enemies in a cone after a short delay. Enemies in the center of the area take 175% damage. This skill costs 3 Combo Points. 30.0"
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}