{
  "basic_info": {
    "name": "Moskov",
    "role": "Unknown",
    "slug": "moskov",
    "image_url": "https://liquipedia.net/commons/images/thumb/f/fc/ML_icon_Moskov_2023.png/20px-ML_icon_Moskov_2023.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/f/fc/ML_icon_Moskov_2023.png/20px-ML_icon_Moskov_2023.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Spear of Quiescence",
      "description": "Spear of QuiescenceAbilityBUFF Moskov's Basic Attacks can penetrate the target and deal (+68% Total Physical Attack)-(+110% Total Physical Attack) Physical Damage to enemies behind them. Each Basic Attack hit reduces the cooldowns of Abyss Walker and Spear of Misery by 0.8s."
    },
    {
      "ability_type": "Skill1",
      "name": "Abyss Walker",
      "description": "Abyss WalkerAbilityBlink BUFF Moskov teleports to the target location, increasing his Attack Speed to 1.3 times for 3s. Meanwhile, his Basic Attack deals 10% more damage to enemies behind the primary target. 7.545"
    },
    {
      "ability_type": "Skill2",
      "name": "Spear of Misery",
      "description": "Spear of MiseryAbilityCC DamageTypePhysical Skill/Blink Moskov launches a powerful strike at the target enemy hero or creep, dealing them 300(+60%Total Physical Attack) Physical Damage, knocking them back, and exposing their position for 5s. If the enemy collides with an enemy hero when knocked back, they'll both take 200(+30%Total Physical Attack) Physical Damage and be stunned for 1.5s. If the enemy is knocked into a wall, they'll be stunned for 1.5s. 12.080"
    },
    {
      "ability_type": "Ultimate",
      "name": "Spear of Destruction",
      "description": "Spear of DestructionAbilityBurst SlowTypePhysical Skill After a short delay, Moskov throws out the Spear of Destruction in the target direction, dealing 600(+100%Total Physical Attack) Physical Damage to enemies in a line and to the first enemy hero hit. Upon hitting an enemy hero, the Spear explodes and deals 780(+130%Total Physical Attack) Physical Damage to enemies behind them. The enemy hero and enemies hit by the explosion are slowed by 50% for 1s. The slow duration scales with the flying distance (up to 5s). 55.0130"
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}