{
  "basic_info": {
    "name": "Nana",
    "role": "Unknown",
    "slug": "nana",
    "image_url": "https://liquipedia.net/commons/images/thumb/4/41/ML_icon_Nana.png/20px-ML_icon_Nana.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/4/41/ML_icon_Nana.png/20px-ML_icon_Nana.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Molina's Gift",
      "description": "Molina's GiftAbilityDeath Immune Upon taking fatal damage, Nana removes all debuffs on her and transforms, becoming untargetable and invincible and gaining 70% extra Movement Speed for 2s. She also recovers 10% Max HP over the duration. Nana can only transform once every 150s and cannot cast skills in the transformed form."
    },
    {
      "ability_type": "Skill1",
      "name": "Magic Boomerang",
      "description": "Magic BoomerangAbilityAoETypeMagic Skill Nana hurls her Magic Boomerang in the target direction, dealing 245 (+120 % Total Magic Power) Magic Damage to enemies hit on its way out and back. This damage is reduced by 20% for each extra enemy hit (up to 60%). 5.550"
    },
    {
      "ability_type": "Skill2",
      "name": "Molina Smooch",
      "description": "Molina SmoochAbilityCC DebuffTypeMagic Skill Nana sends Molina to the target location, who will then seek and chase the nearest enemy hero in the area and transform the first enemy hero it collides with for 1.5s. Molina also deals 250 (+50% Total Magic Power) Magic Damage to the transformed enemy, slows them by 50%, and reduces their Magic Defense by 25% for the duration. Molina will remain stationary for up to 12s if there are no enemy heroes in the area and can chase an enemy hero for up to 2.5s before it disappears. 14.580"
    },
    {
      "ability_type": "Ultimate",
      "name": "Molina Blitz",
      "description": "Molina BlitzAbilityBurst CCTypeMagic Skill Nana summons Molina to attack the target area 3 times, each time dealing 400 (+180% Total Magic Power) Magic Damage to enemies within and slowing them by 50% for 1s. Enemies hit twice will be stunned for 1s. 36.0135"
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}