{
  "basic_info": {
    "name": "Nolan",
    "role": "Unknown",
    "slug": "nolan",
    "image_url": "https://liquipedia.net/commons/images/thumb/6/67/ML_icon_Nolan.png/20px-ML_icon_Nolan.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/6/67/ML_icon_Nolan.png/20px-ML_icon_Nolan.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Dimensional Rift",
      "description": "Dimensional RiftAbilityDamage Nolan's skills will leave a Rift that lasts 5s and slows enemies by 30%. When a rift comes into contact with another rift, they will activate and pull enemies to their center and deal 220 (+140% Extra Physical Attack) Physical Damage after a short delay. Each time a rift activation hits an enemy hero or Creep, Nolan will gain 15 Energy. If an enemy is hit by multiple rift activations, the damage after the first hit will be reduced to 40%. Cosmic Leap: If Nolan does not deal or take damage for 5s, he enhances his next Basic Attack to dash to the target, dealing (120% Total Physical Attack) Physical Damage and leaving a rift. (Damage to and from Minions or Creeps will not prevent Nolan from getting this effect.) The father who swore to protect his shining star."
    },
    {
      "ability_type": "Skill1",
      "name": "Expansion",
      "description": "ExpansionAbilityAoE Nolan cuts a rectangular area in front of him with his cosmic gauge, dealing 230 (+40%Total Physical Attack) Physical Damage and leaving a Rift at the first enemy hit. 2.025The scholar that explored the edge of the universe."
    },
    {
      "ability_type": "Skill2",
      "name": "Gauge",
      "description": "GaugeAbilityBlink Nolan charges in the target direction and slashes with his cosmic gauge, dealing 70 (+13% Total Physical Attack) Physical Damage to enemies in his path and leaving a Rift. 1.525The wayfinder that measured the distance of the stars."
    },
    {
      "ability_type": "Ultimate",
      "name": "Fracture",
      "description": "FractureAbilityRemove CC Nolan removes all debuffs on himself and slashes the target location 3 times, dealing 120 (+50% Extra Physical Attack) Physical Damage with each slash while leaving 3 Rifts. The rifts will activate automatically while Nolan dashes backwards. 20.0The hero that finally returned home."
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}