{
  "basic_info": {
    "name": "Uranus",
    "role": "Unknown",
    "slug": "uranus",
    "image_url": "https://liquipedia.net/commons/images/thumb/8/88/ML_icon_Uranus.png/20px-ML_icon_Uranus.png",
    "thumbnail_url": "https://liquipedia.net/commons/images/thumb/8/88/ML_icon_Uranus.png/20px-ML_icon_Uranus.png"
  },
  "stats": {
    "level": 1
  },
  "abilities": [
    {
      "ability_type": "Passive",
      "name": "Ability Type",
      "description": "Radiance Ability TypeHeal Uranus absorbs the energy generated by incoming attacks to strengthen himself, regenerating a certain amount of HP every 0.8s. Each stack lasts 10s. When at max stacks (20), Uranus regenerates 48-224 HP (scales with level)."
    },
    {
      "ability_type": "Skill1",
      "name": "Ability Type",
      "description": "Ionic Edge Ability TypeAOE Slow DamageMagic Base Cooldown: 4.0 Base Mana Cost: 60 Uranus releases two energy blades that orbit around him, dealing 155 (+30%Total Magic Power) Magic Damage to enemy targets and slowing them by 30% for 2s. Each time this skill deals damage to a target, they will be marked with a stack for 6s (max of 1 stack per target per cast). Each stack increases the damage of this skill by 40% (to a max of 320%). Each energy blade will only deal damage to the same target once."
    },
    {
      "ability_type": "Skill2",
      "name": "Ability Type",
      "description": "Transcendent Ward Ability TypeMobility Shield DamageMagic Base Cooldown: 10.0 Base Mana Cost: 80 Uranus charges to the target location, dealing 80 (+20%Total Magic Power) Magic Damage to enemies along the way, and 160 (+80%Total Magic Power) Magic Damage to enemies at the target location and slowing them by 25%. Uranus also generates a 300 (+200%Total Magic Power) shield for 4s. The shield explodes at the end of its duration or when destroyed, dealing 300 (+150%Total Magic Power) Magic Damage to enemies nearby."
    },
    {
      "ability_type": "Ultimate",
      "name": "Ability Type",
      "description": "Consecration Ability TypeBuff Speed Up Base Cooldown: 42.0 Base Mana Cost: 100 Uranus unleashes the energy stored within his body, removing slow effects on himself, recovering 200 HP, and gaining 60% Movement Speed for 8s (decays over time). Uranus directly gains 5 stacks of Radiance, increasing shields received and HP Regen by 20% for 8s."
    }
  ],
  "lore": {},
  "patches": [],
  "esports_stats": []
}